In [7]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [8]:
df1 = pd.read_csv("Crime data-Drug abuse and enforcement 2012 to 2016_quantity_of_narcotics.csv")
df1.head()

       STATE      2012     2013     2014       2015       2016
0       ABIA  1112.410   451.24   408.06   633.8187   323.4352
1    ADAMAWA  2529.120  1932.50   261.05  5540.3856  6059.1100
2  AKWA IBOM   372.902   402.31   148.65  1358.4505   393.5347
3    ANAMBRA   724.094   434.20   704.69  1720.8925   965.0590
4     BAUCHI  1092.570  6270.70  1036.00  2014.7050  3805.7900

In [9]:
df1.shape

(52, 6)

In [10]:
df2 = pd.read_csv("Crime data-Drug abuse and enforcement 2012 to 2016_NUMBER_OF_SUSPECTS_PROSECUTED.csv")
df2.head()

       STATE   2012   2013  2014  2015   2016
0       ABIA   50.0    6.0  15.0  45.0   47.0
1    ADAMAWA   73.0  127.0  98.0  84.0  120.0
2  AKWA IBOM   44.0   45.0  32.0  30.0   18.0
3    ANAMBRA  108.0    9.0  38.0  22.0   50.0
4     BAUCHI   57.0   23.0  96.0  95.0   46.0

In [11]:
df2.shape

(52, 6)

In [12]:
df3 = pd.read_csv("Crime data-Drug abuse and enforcement 2012 to 2016_Number_of_Counselling_Concluded.csv")
df3.head()

       STATE  2012  2013  2014  2015  2016
0       ABIA   108    67    77    76    27
1    ADAMAWA   189  1989   106    20    54
2  AKWA IBOM   158   205    12   102    36
3    ANAMBRA   102    42    74    82    25
4     BAUCHI   156    86    67    40     3

In [14]:
df3.shape

(43, 6)

In [15]:
df4 = pd.read_csv("Crime data-Drug abuse and enforcement 2012 to 2016_NUMBER_OF_COUNSELLING_CASES.csv")
df4.head()

       STATE  2012  2013  2014  2015  2016
0       ABIA   108    67    77    76    27
1    ADAMAWA   189  1989   118    21    54
2  AKWA IBOM   161   211    12   102    36
3    ANAMBRA   102    51    95    82    25
4     BAUCHI   156    86   101    40     3

In [16]:
df4.shape

(43, 6)

In [17]:
df5 = pd.read_csv("Crime data-Drug abuse and enforcement 2012 to 2016_NUMBER_OF_CONVICTIONS_SECURED.csv")
df5.head()

       STATE  2012   2013  2014  2015   2016
0       ABIA  21.0    6.0  13.0  42.0   46.0
1    ADAMAWA  73.0  127.0  98.0  84.0  120.0
2  AKWA IBOM  44.0   45.0  30.0  30.0   14.0
3    ANAMBRA   7.0    9.0  38.0  20.0   50.0
4     BAUCHI  33.0   23.0  96.0  95.0   46.0

In [18]:
df5.shape

(52, 6)

In [42]:
df6 = pd.read_csv("Crime data-Drug abuse and enforcement 2012 to 2016_number_of_arrested_suspests.csv")
pd.set_option("display.max_columns",None)
# Display all columns in structured format using head()
print(df)

                 STATE        2012        2013        2014         2015  \
0                 ABIA    1112.410     451.240     408.060     633.8187
1              ADAMAWA    2529.120    1932.500     261.050    5540.3856
2            AKWA IBOM     372.902     402.310     148.650    1358.4505
3              ANAMBRA     724.094     434.200     704.690    1720.8925
4               BAUCHI    1092.570    6270.700    1036.000    2014.7050
5              BAYELSA     130.795     221.970     247.500    1175.0011
6                BENUE    1945.840    1549.100    1184.500    1393.5302
7                BORNO      37.555    6270.700    5805.000     250.3067
8          CROSS RIVER     287.384     272.850     246.740     416.5529
9                DELTA   23418.480    8144.000   24052.050   12875.3920
10              EBONYI     243.464     520.920    1053.000     122.7972
11                 EDO   81541.710   48607.000   21179.000  322272.0400
12               EKITI    6685.230    8684.900    2979.400    5244.5922
13               ENUGU    1002.260    1335.500    1089.800     539.9040
14               GOMBE     239.030     164.030     429.120     174.1874
15                 IMO     526.371    1126.100     337.240     346.3010
16              JIGAWA     180.748    1444.000     116.920     858.7984
17              KADUNA    1692.810    2437.600    6375.100   12989.9600
18                KANO    4107.890    4253.900    7522.200   11265.5680
19             KATSINA    1081.040    1511.500     782.930    4016.2947
20               KEBBI     322.874     392.330     276.620    1706.5699
21                KOGI    4071.290    6499.800    6821.400    2237.3755
22               KWARA     763.627    1159.600     843.060    2815.2937
23               LAGOS    2451.230    9163.900    2057.000    2882.9443
24           NASSARAWA     232.359     275.060     573.350    3185.6822
25               NIGER     517.085    2157.500    1570.800    3722.2120
26                OGUN    8469.990    7457.700    2589.500   10137.4500
27                ONDO   61246.350   51093.000   18908.000  384773.4500
28                OSUN    6421.240    3572.700    5789.200    2167.9000
29                 OYO    7232.080   14770.000   10253.000    9344.9714
30             PLATEAU    1822.030    2186.500    1209.900    2259.6491
31              RIVERS     919.952     397.420     385.920     795.7200
32              SOKOTO     788.344    1146.000    1469.700    1824.1935
33              TARABA     474.232     941.700     397.660    1069.4254
34                YOBE     175.767     172.550     398.680     697.0870
35             ZAMFARA    2177.640    1431.100     512.640     271.4991
36                 FCT    5094.300   13622.000    6440.200   10418.2040
37      DOGI(HQ LAGOS)     142.291     904.000   28506.380    1523.7006
38       JTF(HQ LAGOS)     483.552     195.990      32.749     531.2300
39          MMIA-LAGOS     347.430     878.810     436.100    1125.0170
40          NAIA-ABUJA      25.322      45.536      53.410     185.5919
41  PHIA-PORT HARCOURT       2.958       1.142       4.373       0.0000
42          MAKIA-KANO       6.540       3.000       4.373      96.1400
43          AIIA-ENUGU       0.000      20.614       9.050     887.3590
44            SEAPORTS         NaN         NaN         NaN          NaN
45         WHARF-LAGOS      12.360  129901.000       0.000       0.4000
46        TINCAN-LAGOS      23.580       1.440       0.800    3078.5600
47         ONNE-RIVERS       2.535       7.796       0.771       0.2634
48        BORDER POSTS         NaN         NaN         NaN          NaN
49          SEME-LAGOS     420.243     426.000     137.720    1708.7430
50        IDIROKO-OGUN     100.845     126.300      11.200      53.0000
51               Total  233699.749  344985.508  165652.506  834709.1101

           2016
0      323.4352
1     6059.1100
2      393.5347
3      965.0590
4     3805.7900
5      209.5838
6      902.3500
7     1010.4400
8      399.5600
9     8834.1200
10     184.7907
11   59381.6800
12     736.6600
13    4050.4600
14     549.2767
15     348.3341
16    1325.8900
17   17023.7600
18   39557.4100
19    2747.0100
20    5310.4890
21    7549.8400
22     580.8400
23   16570.4300
24    2465.7800
25    3184.6900
26    3294.5700
27   37361.9300
28    1244.2400
29    2868.1100
30    2006.0900
31     899.4343
32     191.7000
33    1710.3000
34     847.4020
35     439.3176
36   16689.3600
37    1812.6500
38    3453.5500
39     729.4580
40     178.1896
41       0.0000
42      11.3000
43      68.4100
44          NaN
45     166.0030
46     218.3980
47       6.2545
48          NaN
49    4235.0700
50      32.0000
51  262934.0602

In [21]:
df6.shape

(67, 16)

In [22]:
df6.isnull().sum()

STATE      2
2012       6
2012.1     6
2012.2    13
2013       6
2013.1     6
2013.2    13
2014       6
2014.1    14
2014.2    13
2015      14
2015.1    14
2015.2    13
2016      15
2016.1    15
2016.2    13
dtype: int64

In [23]:
df6.columns

Index(['STATE', '2012', '2012.1', '2012.2', '2013', '2013.1', '2013.2', '2014',
       '2014.1', '2014.2', '2015', '2015.1', '2015.2', '2016', '2016.1',
       '2016.2'],
      dtype='object')

In [27]:
df6.describe()

,STATE,2012,2012.1,2012.2,2013,2013.1,2013.2,2014,2014.1,2014.2,2015,2015.1,2015.2,2016,2016.1,2016.2
count,65,61,61,54,61,61,54,61,53,54,53,53,54,52,52,54
unique,64,54,34,48,55,33,47,58,25,50,49,22,50,51,25,47
top,Total,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,230.0,0.0,0.0,0.0,0.0,0.0
freq,2,5,15,5,3,17,3,2,18,3,3,10,3,2,10,4

In [31]:
df6.dtypes

STATE     object
2012      object
2012.1    object
2012.2    object
2013      object
2013.1    object
2013.2    object
2014      object
2014.1    object
2014.2    object
2015      object
2015.1    object
2015.2    object
2016      object
2016.1    object
2016.2    object
dtype: object

In [ ]:
print()